# Dataframe

In [1]:
import pandas as pd

In [2]:
dict = { 'CO':100, 'MX': 200, 'AR': 300}
dict

{'CO': 100, 'MX': 200, 'AR': 300}

In [3]:
pd.Series(dict)

CO    100
MX    200
AR    300
dtype: int64

In [6]:
dict_data = {'CH':[100,800,200], 'CO':[100,200,300], 'MX':[300,500,400]}
dict_data

{'CH': [100, 800, 200], 'CO': [100, 200, 300], 'MX': [300, 500, 400]}

In [8]:
df = pd.DataFrame(dict_data)
df

    CH   CO   MX
0  100  100  300
1  800  200  500
2  200  300  400

In [9]:
import numpy as np

In [10]:
dict_data = {
    'edad': [10,9,13,14,12,11,12],
    'cm': [115,110,130,155,125,120,125],
    'pais':['co','mx','co','mx','mx','ch','ch'],
    'genero':['M','F','F','M','M','M','F'],
    'Q1':[5,10,8,np.nan,7,8,3],
    'Q2':[7,9,9,8,8,8,9]
}

In [11]:
df = pd.DataFrame(dict_data)
df

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

In [14]:
# Definir los indices

df = pd.DataFrame(dict_data, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela'])
df

          edad   cm pais genero    Q1  Q2
ana         10  115   co      M   5.0   7
benito       9  110   mx      F  10.0   9
camilo      13  130   co      F   8.0   9
daniel      14  155   mx      M   NaN   8
erika       12  125   mx      M   7.0   8
fabian      11  120   ch      M   8.0   8
gabriela    12  125   ch      F   3.0   9

In [15]:
# Obtener los indices
df.index

Index(['ana', 'benito', 'camilo', 'daniel', 'erika', 'fabian', 'gabriela'], dtype='object')

In [17]:
# Obtener las columnas
df.columns

Index(['edad', 'cm', 'pais', 'genero', 'Q1', 'Q2'], dtype='object')

In [18]:
df.values

array([[10, 115, 'co', 'M', 5.0, 7],
       [9, 110, 'mx', 'F', 10.0, 9],
       [13, 130, 'co', 'F', 8.0, 9],
       [14, 155, 'mx', 'M', nan, 8],
       [12, 125, 'mx', 'M', 7.0, 8],
       [11, 120, 'ch', 'M', 8.0, 8],
       [12, 125, 'ch', 'F', 3.0, 9]], dtype=object)

In [19]:
df['edad']

ana         10
benito       9
camilo      13
daniel      14
erika       12
fabian      11
gabriela    12
Name: edad, dtype: int64

In [20]:
df[['edad', 'cm', 'Q1']]

          edad   cm    Q1
ana         10  115   5.0
benito       9  110  10.0
camilo      13  130   8.0
daniel      14  155   NaN
erika       12  125   7.0
fabian      11  120   8.0
gabriela    12  125   3.0

In [21]:
# Seleccionar datos a través de sus indices y columnas
df.loc['ana', ['edad', 'cm', 'Q1']]

edad     10
cm      115
Q1      5.0
Name: ana, dtype: object

In [22]:
df.loc[['ana', 'erika'], ['edad', 'cm', 'Q1']]

       edad   cm   Q1
ana      10  115  5.0
erika    12  125  7.0

In [23]:
# Selección a tráves de la posición
df.iloc[2,1]

130

In [24]:
df.iloc[:, [1,3]]

           cm genero
ana       115      M
benito    110      F
camilo    130      F
daniel    155      M
erika     125      M
fabian    120      M
gabriela  125      F

## Filtros basados en condiciones

In [25]:
df['edad'] > 12

ana         False
benito      False
camilo       True
daniel       True
erika       False
fabian      False
gabriela    False
Name: edad, dtype: bool

In [26]:
df[df['edad'] > 12]

        edad   cm pais genero   Q1  Q2
camilo    13  130   co      F  8.0   9
daniel    14  155   mx      M  NaN   8

In [28]:
df[(df['edad'] > 12) & (df['pais'] == 'mx')]

        edad   cm pais genero  Q1  Q2
daniel    14  155   mx      M NaN   8

In [29]:
df.query('edad > 12')

        edad   cm pais genero   Q1  Q2
camilo    13  130   co      F  8.0   9
daniel    14  155   mx      M  NaN   8

In [30]:
df[df['Q2'] >= df['Q1']]

          edad   cm pais genero   Q1  Q2
ana         10  115   co      M  5.0   7
camilo      13  130   co      F  8.0   9
erika       12  125   mx      M  7.0   8
fabian      11  120   ch      M  8.0   8
gabriela    12  125   ch      F  3.0   9